#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Движения по регистру Взаиморасчеты
	Движения.Взаиморасчеты.Записывать = Истина;
	Для Каждого СтрокаТЧ Из Начисления Цикл
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Арендатор = Арендатор;
		Движение.Сумма = СтрокаТЧ.Сумма;
	КонецЦикла;

	// Движения по регистру Выручка аренда
	Движения.ВыручкаАренда.Записывать = Истина;
	Для Каждого СтрокаТЧ Из Начисления Цикл
		Движение = Движения.ВыручкаАренда.Добавить();
		Движение.Период = Дата;
		Движение.Арендатор = Арендатор;
		Движение.Сумма = СтрокаТЧ.Сумма;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
