#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Движения по регистру Остатки занятий
	Движения.ОстаткиЗанятий.Записывать = Истина;
	Движение = Движения.ОстаткиЗанятий.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.ВидАбонемента = ВидАбонемента;
	Движение.КоличествоЗанятий = 1;

	// Движения по регистру Посещаемость
	Движения.Посещаемость.Записывать = Истина;
	Движение = Движения.Посещаемость.Добавить();
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.Тренер = Тренер;
	Движение.КоличествоВизитов = 1;

	// Контроль остатков по регистру Остатки занятий
	Движения.ОстаткиЗанятий.БлокироватьДляИзменения = Истина;
	Движения.ОстаткиЗанятий.Записать();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Клиент КАК Клиент,
	|	Остатки.ВидАбонемента КАК ВидАбонемента,
	|	Остатки.КоличествоЗанятийОстаток КАК КоличествоЗанятийОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиЗанятий.Остатки(
	|			,
	|			(Клиент, ВидАбонемента) В
	|				(ВЫБРАТЬ
	|					Т.Клиент, Т.ВидАбонемента
	|				ИЗ
	|					РегистрНакопления.ОстаткиЗанятий КАК Т
	|				ГДЕ
	|					Т.Регистратор = &Ссылка)) КАК Остатки
	|ГДЕ
	|	Остатки.КоличествоЗанятийОстаток < 0";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Недостаточно остатка (Остатки занятий): " + Строка(Выборка.Клиент) + ", " + Строка(Выборка.ВидАбонемента) + ". Не хватает: " + Строка(-Выборка.КоличествоЗанятийОстаток);
		Сообщение.Сообщить();
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
