#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Движения по регистру Остатки книг на руках
	Движения.ОстаткиКнигНаРуках.Записывать = Истина;
	Для Каждого СтрокаТЧ Из Книги Цикл
		Движение = Движения.ОстаткиКнигНаРуках.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Книга = СтрокаТЧ.Книга;
		Движение.Читатель = Читатель;
		Движение.Количество = СтрокаТЧ.Количество;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
