#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Движения по регистру Кадровая история
	Движения.КадроваяИстория.Записывать = Истина;
	Движение = Движения.КадроваяИстория.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.Должность = Перечисления.СтатусСотрудника.Уволен;
	Движение.Подразделение = Перечисления.СтатусСотрудника.Уволен;
	Движение.Оклад = 0;
	Движение.Статус = Перечисления.СтатусСотрудника.Уволен;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
