#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Движения по регистру Кадровая история
	Движения.КадроваяИстория.Записывать = Истина;
	Движение = Движения.КадроваяИстория.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.Должность = Должность;
	Движение.Подразделение = Подразделение;
	Движение.Оклад = Оклад;
	Движение.Статус = Перечисления.СтатусСотрудника.Работает;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
