#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Движения по регистру Успеваемость
	Движения.Успеваемость.Записывать = Истина;
	Для Каждого СтрокаТЧ Из Оценки Цикл
		Движение = Движения.Успеваемость.Добавить();
		Движение.Период = Дата;
		Движение.Ученик = СтрокаТЧ.Ученик;
		Движение.Предмет = Предмет;
		Движение.СуммаОценок = СтрокаТЧ.Оценка;
		Движение.КоличествоОценок = 1;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
