#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Движения по регистру Занятость столиков
	Движения.ЗанятостьСтоликов.Записывать = Истина;
	Движение = Движения.ЗанятостьСтоликов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Столик = Заказ.Столик;
	Движение.Количество = 1;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
