#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Движения по регистру Остатки запчастей
	Движения.ОстаткиЗапчастей.Записывать = Истина;
	Для Каждого СтрокаТЧ Из Запчасти Цикл
		Движение = Движения.ОстаткиЗапчастей.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Запчасть = СтрокаТЧ.Запчасть;
		Движение.Количество = СтрокаТЧ.Количество;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
