#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Движения по регистру Выручка
	Движения.Выручка.Записывать = Истина;
	Для Каждого СтрокаТЧ Из Услуги Цикл
		Движение = Движения.Выручка.Добавить();
		Движение.Период = Дата;
		Движение.Мастер = Мастер;
		Движение.Услуга = СтрокаТЧ.Услуга;
		Движение.Сумма = СтрокаТЧ.Сумма;
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Для Каждого СтрокаТЧ Из Услуги Цикл
		СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если Статус = Перечисления.СтатусыЗаказов.Завершен И Услуги.Количество() = 0 Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
