#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Движения по регистру Остатки книг на руках
	Движения.ОстаткиКнигНаРуках.Записывать = Истина;
	Для Каждого СтрокаТЧ Из Книги Цикл
		Движение = Движения.ОстаткиКнигНаРуках.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Книга = СтрокаТЧ.Книга;
		Движение.Читатель = Читатель;
		Движение.Количество = СтрокаТЧ.Количество;
	КонецЦикла;

	// Контроль остатков по регистру Остатки книг на руках
	Движения.ОстаткиКнигНаРуках.БлокироватьДляИзменения = Истина;
	Движения.ОстаткиКнигНаРуках.Записать();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Книга КАК Книга,
	|	Остатки.Читатель КАК Читатель,
	|	Остатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиКнигНаРуках.Остатки(
	|			,
	|			(Книга, Читатель) В
	|				(ВЫБРАТЬ
	|					Т.Книга, Т.Читатель
	|				ИЗ
	|					РегистрНакопления.ОстаткиКнигНаРуках КАК Т
	|				ГДЕ
	|					Т.Регистратор = &Ссылка)) КАК Остатки
	|ГДЕ
	|	Остатки.КоличествоОстаток < 0";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Недостаточно остатка (Остатки книг на руках): " + Строка(Выборка.Книга) + ", " + Строка(Выборка.Читатель) + ". Не хватает: " + Строка(-Выборка.КоличествоОстаток);
		Сообщение.Сообщить();
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
