#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Движения по регистру Продажи блюд
	Движения.ПродажиБлюд.Записывать = Истина;
	Для Каждого СтрокаТЧ Из Блюда Цикл
		Движение = Движения.ПродажиБлюд.Добавить();
		Движение.Период = Дата;
		Движение.Блюдо = СтрокаТЧ.Блюдо;
		Движение.Официант = Официант;
		Движение.Сумма = СтрокаТЧ.Сумма;
	КонецЦикла;

	// Движения по регистру Выручка по официантам
	Движения.ВыручкаПоОфициантам.Записывать = Истина;
	Для Каждого СтрокаТЧ Из Блюда Цикл
		Движение = Движения.ВыручкаПоОфициантам.Добавить();
		Движение.Период = Дата;
		Движение.Официант = Официант;
		Движение.Сумма = СтрокаТЧ.Сумма;
	КонецЦикла;

	// Движения по регистру Занятость столиков
	Движения.ЗанятостьСтоликов.Записывать = Истина;
	Движение = Движения.ЗанятостьСтоликов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Столик = Столик;
	Движение.Количество = 1;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Для Каждого СтрокаТЧ Из Блюда Цикл
		СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
