#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Движения по регистру Местонахождение оборудования
	Движения.МестонахождениеОборудования.Записывать = Истина;
	Движение = Движения.МестонахождениеОборудования.Добавить();
	Движение.Период = Дата;
	Движение.Оборудование = Оборудование;
	Движение.МестоУстановки = МестоОтправитель;
	Движение.Ответственный = НовыйОтветственный;
	Движение.Количество = 1;

	// Движения по регистру Местонахождение оборудования
	Движения.МестонахождениеОборудования.Записывать = Истина;
	Движение = Движения.МестонахождениеОборудования.Добавить();
	Движение.Период = Дата;
	Движение.Оборудование = Оборудование;
	Движение.МестоУстановки = МестоПолучатель;
	Движение.Ответственный = НовыйОтветственный;
	Движение.Количество = 1;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
